src/cf/Catalogs/EmailProcessingRules.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>EmailProcessingRules</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.EmailAccounts</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SettingsComposer</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PutInFolder</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EmailMessageFolders</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddlOrderingAttribute</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FilterPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/InteractionsFolderSubjects.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>InteractionsFolderSubjects</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Topic</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.InteractionSubject</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EmailMessageFolder</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EmailMessageFolders</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Reviewed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReviewAfter</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Interaction</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.OutgoingEmail</v8:Type>
						<v8:Type>cfg:DocumentRef.PlannedInteraction</v8:Type>
						<v8:Type>cfg:DocumentRef.IncomingEmail</v8:Type>
						<v8:Type>cfg:DocumentRef.PhoneCall</v8:Type>
						<v8:Type>cfg:DocumentRef.Meeting</v8:Type>
						<v8:Type>cfg:DocumentRef.SMSMessage</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/IncomingEmail.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>IncomingEmail</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Importance</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InteractionImportanceOptions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InternalTitle</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateReceived</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HasAttachments</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDAtServer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BasisID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MessageID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BasisIDs</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encoding</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmployeeResponsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SenderAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SenderContact</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.InteractionContact</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SenderPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Delete_Reviewed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Delete_ReviewAfter</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteSubject</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.InteractionSubject</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Size</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CcRecipientsList</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailRecipientsList</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Text</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Subject</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EmailTextTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EmailAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InteractionBasis</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.OutgoingEmail</v8:Type>
						<v8:Type>cfg:DocumentRef.IncomingEmail</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RequestDeliveryReceipt</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RequestReadReceipt</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HashSum</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>EmailRecipients</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Address</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Contact</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.InteractionContact</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CCRecipients</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Address</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Contact</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.InteractionContact</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ReplyRecipients</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Address</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Contact</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.InteractionContact</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AccessValuesSets</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SetNumber</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccessValue</Name>
							<Comment>Blank values must be allowed in order to avoid errors when writing the objects being checked</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.AccessValue</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Clarification</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Read</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Update</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ReadReceiptAddresses</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Address</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Contact</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.InteractionContact</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>PendingAttachments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>NameAttachment</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/EmailProcessingRules/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, 1C-Soft LLC
// All Rights reserved. This application and supporting materials are provided under the terms of 
// Attribution 4.0 International license (CC BY 4.0)
// The license text is available at:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#Region ForCallsFromOtherSubsystems

// StandardSubsystems.BatchObjectsModification

// Returns the object attributes that are not recommended to be edited using batch attribute 
// modification data processor.
//
// Returns:
//  Array - a list of object attribute names.
Function AttributesToSkipInBatchProcessing() Export
	
	Result = New Array;
	Result.Add("Code");
	Result.Add("Description");
	Result.Add("SettingsComposer");
	Result.Add("PutInFolder");
	Result.Add("AddlOrderingAttribute");
	Result.Add("FilterPresentation");
	Return Result;
	
EndFunction

// End StandardSubsystems.BatchObjectsModification

// StandardSubsystems.AccessManagement

// See AccessManagementOverridable.OnFillListsWithAccessRestriction. 
Procedure OnFillAccessRestriction(Restriction) Export
	
	Restriction.Text =
	"AllowReadUpdate
	|WHERE
	|	ValueAllowed(Owner)
	|	OR ValueAllowed(Owner.AccountOwner, EmptyRef AS False)";
	
EndProcedure

// End StandardSubsystems.AccessManagement

#EndRegion

#EndRegion

#Region Internal

// Applies email processing rules.
//
// Parameters:
//  ExportParameters - Structure - contains the following fields.
//                 - ForEmailsInFolder     - Catalog.EmailsFolders - emails stored in the folder
//                 will be processed.
//                 - IncludingSubordinateFolders - Boolean - shows that emails in subordinate folders must be processed.
//                 - RulesTable      - ValueTable - a table of rules that must be applied.
//  StorageAddress - String -             - a message about the rule application result.
//
Procedure ApplyRules(ExportParameters, StorageAddress) Export
	
	MapsTable = New ValueTable;
	MapsTable.Columns.Add("Folder");
	MapsTable.Columns.Add("Email");
	
	ConditionTextByFolder = ?(ExportParameters.IncludeSubordinateSubsystems," IN HIERARCHY(&EmailMessageFolder) "," = &EmailMessageFolder ");
	
	Query = New Query;
	Query.Text = "SELECT
	|	SelectedRules.Rule,
	|	SelectedRules.Apply
	|INTO SelectedRules
	|FROM
	|	&SelectedRules AS SelectedRules
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	SelectedRules.Rule,
	|	EmailProcessingRules.SettingsComposer,
	|	EmailProcessingRules.PutInFolder
	|FROM
	|	SelectedRules AS SelectedRules
	|		INNER JOIN Catalog.EmailProcessingRules AS EmailProcessingRules
	|		ON SelectedRules.Rule = EmailProcessingRules.Ref
	|WHERE
	|	SelectedRules.Apply
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT DISTINCT
	|	IncomingEmail.Ref,
	|	InteractionsFolderSubjects.EmailMessageFolder AS Folder
	|FROM
	|	Document.IncomingEmail AS IncomingEmail
	|		LEFT JOIN InformationRegister.InteractionsFolderSubjects AS InteractionsFolderSubjects
	|		ON InteractionsFolderSubjects.Interaction = IncomingEmail.Ref
	|WHERE
	|	InteractionsFolderSubjects.EmailMessageFolder " + ConditionTextByFolder +"
	|
	|UNION ALL
	|
	|SELECT
	|	OutgoingEmail.Ref,
	|	InteractionsFolderSubjects.EmailMessageFolder
	|FROM
	|	Document.OutgoingEmail AS OutgoingEmail
	|		LEFT JOIN InformationRegister.InteractionsFolderSubjects AS InteractionsFolderSubjects
	|		ON InteractionsFolderSubjects.Interaction = OutgoingEmail.Ref
	|WHERE
	|	InteractionsFolderSubjects.EmailMessageFolder " + ConditionTextByFolder ;
	
	Query.SetParameter("SelectedRules", ExportParameters.RulesTable);
	Query.SetParameter("EmailMessageFolder", ExportParameters.ForEmailsInFolder);
	
	Result = Query.ExecuteBatch();
	If Result[2].IsEmpty() Then
		MessageText = NStr("ru = 'В выбранной папке нет писем.'; en = 'Selected folder is empty.'; pl = 'Selected folder is empty.';de = 'Selected folder is empty.';ro = 'Selected folder is empty.';tr = 'Selected folder is empty.'; es_ES = 'Selected folder is empty.'");
		PutToTempStorage(MessageText, StorageAddress);
		Return;
	EndIf;
	
	EmailsTable = Result[2].Unload();
	EmailsArray  = EmailsTable.UnloadColumn("Ref");
	FoldersArray  = EmailsTable.UnloadColumn("Folder");
	FoldersArray  = Interactions.DeleteDuplicateElementsFromArray(FoldersArray);
	
	Selection = Result[1].Select();
	While Selection.Next() Do
		
		ProcessingRulesSchema = GetTemplate("EmailProcessingRuleScheme");
		
		TemplateComposer = New DataCompositionTemplateComposer();
		SettingsComposer = New DataCompositionSettingsComposer;
		SettingsComposer.Initialize(New DataCompositionAvailableSettingsSource(ProcessingRulesSchema));
		SettingsComposer.LoadSettings(Selection.SettingsComposer.Get());
		SettingsComposer.Refresh(DataCompositionSettingsRefreshMethod.CheckAvailability);
		CommonClientServer.SetFilterItem(SettingsComposer.Settings.Filter,
			"Ref",EmailsArray,DataCompositionComparisonType.InList);
		CommonClientServer.SetFilterItem(SettingsComposer.Settings.Filter,
			"Ref.Account",ExportParameters.Account,DataCompositionComparisonType.Equal);
		
		DataCompositionTemplate = TemplateComposer.Execute(ProcessingRulesSchema,
			SettingsComposer.GetSettings(),,,Type("DataCompositionValueCollectionTemplateGenerator"));
		
		QueryText = DataCompositionTemplate.DataSets.MainDataSet.Query;
		QueryRule = New Query(QueryText);
		For each Parameter In DataCompositionTemplate.ParameterValues Do
			QueryRule.Parameters.Insert(Parameter.Name, Parameter.Value);
		EndDo;
		
		EmailResult = QueryRule.Execute();
		If Not EmailResult.IsEmpty() Then
			EmailSelection = EmailResult.Select();
			While EmailSelection.Next() Do
				
				NewTableRow = MapsTable.Add();
				NewTableRow.Folder = Selection.PutInFolder;
				NewTableRow.Email = EmailSelection.Ref;
				
				ArrayElementIndexForDeletion = EmailsArray.Find(EmailSelection.Ref);
				If ArrayElementIndexForDeletion <> Undefined Then
					EmailsArray.Delete(ArrayElementIndexForDeletion);
				EndIf;
			EndDo;
		EndIf;
		
	EndDo;
	
	For each TableRow In MapsTable Do
		InteractionsServerCall.SetEmailFolder(
			TableRow.Email, TableRow.Folder, False);
			If ValueIsFilled(TableRow.Folder) AND FoldersArray.Find(TableRow.Folder) = Undefined Then
				 FoldersArray.Add(TableRow.Folder);
			EndIf;
	EndDo;
		
	Interactions.CalculateReviewedByFolders(Interactions.TableOfDataForReviewedCalculation(FoldersArray, "Folder"));
	
	If MapsTable.Count() > 0 Then
		MessageText = NStr("ru = 'Перенос писем в папки выполнен.'; en = 'Emails were moved into folders.'; pl = 'Emails were moved into folders.';de = 'Emails were moved into folders.';ro = 'Emails were moved into folders.';tr = 'Emails were moved into folders.'; es_ES = 'Emails were moved into folders.'");
	Else
		MessageText =  NStr("ru = 'Ни одно письмо не было перенесено'; en = 'No messages transferred'; pl = 'No messages transferred';de = 'No messages transferred';ro = 'No messages transferred';tr = 'No messages transferred'; es_ES = 'No messages transferred'");
	EndIf;
	
	PutToTempStorage(MessageText, StorageAddress);
	
EndProcedure

#EndRegion

#EndIf
